In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['OdName','AreaName',1980]]
df_new = df_new.head()
df_OdName = df_new.set_index('OdName')

# Modify a Entire ROW

In [4]:
df_OdName

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0

In [6]:
df_OdName.loc["Algeria"] = ["Africa Continent", 80]  #All column values need to be provided

In [7]:
df_OdName

                        AreaName  1980
OdName
Afghanistan                 Asia    16
Albania                   Europe     1
Algeria         Africa Continent    80
American Samoa           Oceania     0
Andorra                   Europe     0

# Modification of Specific values from ROW

In [14]:
df_new = df[['OdName','AreaName',1980,1981]]
df_new = df_new.head()
df_new = df_new.set_index("OdName")
df_new

               AreaName  1980  1981
OdName
Afghanistan        Asia    16    39
Albania          Europe     1     0
Algeria          Africa    80    67
American Samoa  Oceania     0     1
Andorra          Europe     0     0

In [20]:
df_new.loc["Algeria",1980] = 1000

In [21]:
df_new

               AreaName  1980  1981
OdName
Afghanistan        Asia    16    39
Albania          Europe     1     0
Algeria          Africa  1000    67
American Samoa  Oceania     0     1
Andorra          Europe     0     0

In [24]:
df_new.loc["Albania", ["AreaName",1981]] = ["Europe Continent", 5000]

In [25]:
df_new

                        AreaName  1980  1981
OdName
Afghanistan                 Asia    16    39
Albania         Europe Continent     1  5000
Algeria                   Africa  1000    67
American Samoa           Oceania     0     1
Andorra                   Europe     0     0